---
kind: property
id: P:Autodesk.Revit.DB.Visual.Concrete.ConcreteColor
source: html/024bb088-3319-4661-abac-d5f649ebdc60.htm
---
# Autodesk.Revit.DB.Visual.Concrete.ConcreteColor Property

The property labeled "Color" from the "Concrete" schema.

## Syntax (C#)
```csharp
public static string ConcreteColor { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.